###############################################################
## CNU 버거 키오스크 프로그램
## 일자: 2021.10.12
## 작성자: 최철웅
## 내용: Console기반의 햄버거를 판매하는 키오스크 프로그램

# 조건
# 사용자는 최대로 버거1개, 사이드1개, 음료1개 주문할 수 있습니다.


# >> View단: 메뉴 선택(최초)
burger_name = {1: '치즈버거', 2:'불고기버거', 3: '새우버거'}



menu_save = {}
price_save = {}


print('■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■')
print('■■ == CNU 버거(ver.01) ==')
print('■■ CNU 버거에 방문해주셔서 감사합니다.')
print('■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■')
print('□■ 메뉴')
print('□■ 1.햄버거 세트')
print('□■ 2.햄버거 단품')
print('□■ 3.사이드 메뉴')
print('□■ 4.음료')
print('■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■')

while True:
    print('■■ 원하시는 메뉴의 번호를 입력해주세요.')
    menu_num = int(input('>> 번호:'))  # 사용자부터 주문 MENU 입력

    if menu_num >= 1 and menu_num <= 4:
        break
    else:
        print('# MSG: 1~4의 번호만 입력해주세요 :)')


# >> View단: 세부메뉴 선택
if menu_num == 1:    # 햄버거 세트
    print('■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■')
    print('□■  BURGER MENU')
    print('□■  1.치즈버거 세트: 3,500원')
    print('□■  2.불고기버거 세트: 3,000원')
    print('□■  3.새우버거 세트: 2,500원')
    print('■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■')
    print('■■ 원하시는 메뉴의 번호를 입력해주세요.')

    # while True:


elif menu_num == 2:  # 햄버거 단품
    print('■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■')
    print('□■  BURGER MENU')
    print('□■  1.치즈버거: 3,500원')
    print('□■  2.불고기버거: 3,000원')
    print('□■  3.새우버거: 2,500원')
    print('■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■')
    print('■■ 원하시는 메뉴의 번호를 입력해주세요.')

elif menu_num == 3:  # 사이드 메뉴
    print('■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■')
    print('□■  BURGER MENU')
    print('□■  1.프렌치프라이: 1,500원')
    print('□■  2.치킨너겟: 2,000원')
    print('■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■')
    print('■■ 원하시는 메뉴의 번호를 입력해주세요.')

elif menu_num == 4:  # 음료
    print('■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■')
    print('□■  BURGER MENU')
    print('□■  1.코카콜라: 1,000원')
    print('□■  2.커피: 1,200원')
    print('□■  3.주스: 1,500원')
    print('■■ 원하시는 메뉴의 번호를 입력해주세요.')
    print('■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■')
